projects = [
    # КЪЩА ЛЮЦКАНОВИ 230512
    {
    "id": 15,
    "name": 'Къща част от затворен комплекс',
    "end date": "2023-05-12",
    "end month": "05",
    "end year": "2023",
    "description": """Луксозна къща с лятна кухня, част от затворен комплекс. Проектът включва хол 
                    през две нива, спа зона и работни кабинети и жилищни помещения. По желание на 
                    клиента беше изпълнена симулация на целодневното ослънчаването в хола и 
                    интерактивна презентация с включени 2D, 3D и виртуална реалност""",
    "cover": "kashta_german/00.jpg",
    "gallery": [
        "/kashta_german/00.jpg", 
        "/kashta_german/01.jpg", 
        "/kashta_german/02.jpg", 
        "/kashta_german/03.jpg"
        ],
    "technologies": ["Autocad", "Archicad"],
    "address": "с. Герман",
    },


    # СЪД СТАМБОЛИЙСКИ 230512
    {
    "id": 14,
    "name": 'ИП за ремонт и преустройство на сграда на съдебната власт',
    "end date": "2023-05-11",
    "end month": "05",
    "end year": "2023",
    "description": """ИП за ремонт и преустройство на сградата на бившия Механо техникум 
                    за нуждите на съдебната власт. Сградата не е паметник на културата, 
                    но имаше изискване за минимална намеса по фасадите. Интересното на този обект беше
                    да се приведе към действащата противопожарна наредба. Това наложи направа на външно
                     евакуационно стълбище и корекция в наклона на един от скатовете на покрива. За да се 
                     осигурят минималният брой изискуеми паркоместа беше предвиден подземен паркинг с
                     отворена част, за да се избегне нуждата от изграждане на пожарогасителна инсталация.""",
    "cover": "sad_stamboliiski/00.jpg", 
    "gallery": [
        "/sad_stamboliiski/00.jpg", 
        "/sad_stamboliiski/01.jpg", 
        "/sad_stamboliiski/02.jpg", 
        "/sad_stamboliiski/03.jpg", 
        "/sad_stamboliiski/04.jpg", 
        "/sad_stamboliiski/05.jpg", 
        "/sad_stamboliiski/06.jpg", 
        "/sad_stamboliiski/07.jpg", 
        "/sad_stamboliiski/08.jpg", 
        ],
    "technologies": ["Autocad", "Archicad"],
    "address": "София, бул. Стамболийски",
    },


    # ЕДНО ВРЕМЕ 220805
    {
    "id": 13,
    "name": 'Къща за гости "Едно време"',
    "end date": "2022-08-05",
    "end month": "08",
    "end year": "2022",
    "description": """Къща за гости в зона на културно наследство. Триетажната сграда съчетава 
                    традиционната карловска архитектура с модернистични елементи, използвайки 
                    естествени материали като камък и дърво. Първият етаж включва рецепция, дневна и 
                    стаи със самостоятелни изходи към двора. Проектът придава уют и функционалност,
                    осигурявайки комфорт за гостите в съвременна среда.""",
    "cover": "edno_vreme/00.jpg", 
    "gallery": [
        "/edno_vreme/00.jpg", 
        "/edno_vreme/01.jpg", 
        "/edno_vreme/02.jpg", 
        "/edno_vreme/03.jpg", 
        "/edno_vreme/04.jpg", 
        ],
    "technologies": ["Archicad", "Autocad", ],
    "address": "Карлово, ул.Раковска 7",
    "link": "https://ednovreme.eu/",
    },


    # КАЛКУЛАТОР ЗА ПЛОЩИ
    {
    "id": 12,
    "name": 'Калкулатор за площи',
    "end date": "2023-07-27",
    "end month": "07",
    "end year": "2023",
    "description": """Личен проект за пресмятане на площите необходими за изготвяне на количествени сметки.
                    В таблицата се описват параметрите и елементите на помещенията, и предвидените покрития.
                    Накрая системата извежда сумата на всички предвидени материали. Възможността за прецизно 
                    описание на помещенията дава много висока точност на резултатите и възможност за бърза 
                    проверка, при съмнение за грешка. Системата може да пресмята и помещения със сложна форма,
                    включително и тавански скосени стаи. В линка по-долу можете да видите и видео представяне.""",
    "cover": "calculator/00.jpg",
    "gallery": ["/calculator/00.jpg", ],
    "technologies": ["MS_Office", "automation", ],
    "presentation": "https://youtu.be/L6cfmNA_J-s",
    },


    # КЪЩА ОСОИЦА
    {
    "id": 11,
    "name": 'Еднофамилна къща',
    "end date": "2022-07-27",
    "end month": "07",
    "end year": "2022",
    "description": """Двуетажна еднофамилна къща. Проектът включва общи помещения (зона 'ден') 
                    на първи етаж и спални на втори етаж (зона 'нощ'). До къщата е долепена 
                    лятна кухня с трапезария, а до нея гараж за два автомобила. По желание на 
                    клиента беше изпълнена интерактивна презентация с включени 2D, 3D и виртуална 
                    реалност. За съжаление проектът не се реализира.""",
    "cover": "kashta_osoica/00.jpg",
    "gallery": [
        "/kashta_osoica/01.jpg", 
        "/kashta_osoica/02.jpg", 
        "/kashta_osoica/03.jpg", 
        "/kashta_osoica/03.jpg", 
        "/kashta_osoica/04.jpg", 
        "/kashta_osoica/05.jpg", ],
    "technologies": ["Autocad", "Archicad", ],
    "address": "с. Осойца",
    },


    # ЕЕ ВАСИЛ АПРИЛОВ 220324
    {
    "id": 10,
    "name": 'Саниране на блок в Пловдив, ул.Васил Априлов',
    "end date": "2022-03-24",
    "end month": "03",
    "end year": "2022",
    "description": "Саниране на жилищен блок с четири входа по програмата за енергийна ефективност.",
    "cover": "plovdiv_aprilov/00.jpg", 
    "gallery": ["/plovdiv_aprilov/00.jpg", "/plovdiv_aprilov/01.jpg", "/plovdiv_aprilov/02.jpg", ],
    "technologies": ["Autocad", ],
    "address": "Пловдив, бул.Васил Априлов", 
    },


    # 3D ИЛИНДЕН 220218
    {
    "id": 9,
    "name": 'Видео разходка около жилищна сграда на Захарна фабрика',
    "end date": "2022-02-18",
    "end month": "02",
    "end year": "2022",
    "description": "Реставрация на сграда паметник на културата, част от комплекса на Захарна фабрика. Моето участие беше направата на тази виртуална разходка около сградата.",
    "cover": "Ilinden/00.jpg", 
    "gallery": ["/Ilinden/00.jpg", "/Ilinden/01.jpg", "/Ilinden/02.jpg", ],
    "technologies": ["Archicad", "Lumion"],
    "presentation": "https://youtu.be/zj62q2KO0ik",
    "address": "София, кв. Илинден",    
    },


    # ЦОП ВАРНА 200331
    {
    "id": 8,
    "name": 'Център за подкрепа на лица с увреждания',
    "end date": "2020-03-31",
    "end month": "03",
    "end year": "2020",
    "description": """Проект за реновиране на съществуваща сграда в ж.к. „Дружба“, Варна, 
                    за „Център за подкрепа на лица с увреждания“. Центърът осигурява дневна 
                    и почасова грижа, рехабилитация, консултации и арт-терапия за до 90 души. 
                    Пространството включва специализирани зали, медицински кабинет, кухни и 
                    санитарни помещения, с акцент върху достъпност и безопасност. Интериорът е с 
                    функционално разпределение и материали, позволяващи лесна поддръжка и дълготрайност.""",
    "cover": "cop_varna/00.jpg", 
    "gallery": ["/cop_varna/00.jpg", "/cop_varna/01.jpg", "/cop_varna/02.jpg", ],
    "technologies": ["Autocad", ],
    "address": "Варна, кв. „Аспарухово“, блок 11,",
    "link": "https://live.varna.bg/bg/news/dneven_centar_za_palnoletni_lica_s_tejki_uvrejdania_zapochva_rabota_ot_parvi_april.html",    
    },


    # АВТОМАТИЧНИ КОТИ
    {
    "id": 7,
    "name": 'Автоматични коти',
    "end date": "2024-07-27",
    "end month": "07",
    "end year": "2024",
    "description": """Личен проект за автоматично пресмятане на котите по височина.
                    Това са динамични свързани блокове, с които работя много по-бързо и по-точно. 
                    Има една водеща кота, която се поставя в ситуацията - от нея се задава 
                    абсолютната височина на кота ±0,00. Останалите коти се разполагат по планове и 
                    фасади. Те са свързани и при корекции отчитат промените в абсолютната височина и 
                    разликите във височините между тях. В линка по-долу можете да видите и видео представяне.""",
    "cover": "koti/00.jpg",
    "gallery": ["/koti/00.jpg", ],
    "technologies": ["Autocad", "automation", ],
    "presentation": "https://youtu.be/-0vN-n0wpHw",
    },

    # СОУ ЛУКОВИТ 190603
    {
    "id": 6,
    "name": 'Саниране на СОУ Алеко Константинов',
    "end date": "2019-06-03",
    "end month": "06",
    "end year": "2019",
    "description": """Проект за саниране на СОУ Алеко Константинов. В училището бяха изпълнени 
                    мерки за привеждане към нормите за достъпна среда, вкл. изграждане на асансьор. 
                    В дворното пространство бяха изпълнени нови спортни съоръжения и рехабилитирани 
                    старите салон, игрища и съблекални.""",
    "cover": "sou_konstantinov/00.jpg",
    "gallery": [
        "/sou_konstantinov/00.jpg", 
        "/sou_konstantinov/01.jpg", 
        "/sou_konstantinov/02.jpg", 
        "/sou_konstantinov/03.jpg", 
        "/sou_konstantinov/04.jpg", 
        "/sou_konstantinov/05.jpg", 
        "/sou_konstantinov/06.jpg", 
        ],
    "technologies": ["Autocad", ],
    "address": "Луковит, ул. Възраждане 104",
    "link": "https://su-lukovit.com/c-priem",    
    },


    # ЦОП ПЛОВДИВ 190311
    {
    "id": 5,
    "name": 'Реконструкция на Център за обществена подкрепа',
    "end date": "2019-03-11",
    "end month": "03",
    "end year": "2019",
    "description": """Сградата e построена през 1884г, е културна ценност с местно значение. 
                Проектът предвижда трансформация на сградата в общностен център, състоящ се от 
                три крила за социални услуги, с минимална фасадна намеса. Включва центрове за 
                обществена подкрепа и дневни центрове за деца с увреждания, с осигурена достъпна 
                среда чрез рампи, широки входове и асансьори. Разполагане на специализирано 
                медицинско и рехабилитационно обзавеждане според зададени функции.""",
    "cover": "cop_plovdiv/00.jpg", 
    "gallery": ["/cop_plovdiv/00.jpg", "/cop_plovdiv/01.jpg", "/cop_plovdiv/02.jpg", "/cop_plovdiv/03.jpg", "/cop_plovdiv/04.jpg", "/cop_plovdiv/05.jpg" ],
    "technologies": ["Autocad", ],
    "address": "Пловдив, ул. Димитър Цончев № 11",
    "link": "https://detebg.org/",    
    },


    # ЕЕ ПЛОВДИВ ЛОТОС 180709
    {
    "id": 4,
    "name": 'Саниране на блок в Пловдив, ул.Лотос',
    "end date": "2018-07-09",
    "end month": "07",
    "end year": "2018",
    "description": "Саниране на дву секционен жилищен блок по програмата за енергийна ефективност.",
    "cover": "lotos/00.jpg",
    "gallery": ["/lotos/00.jpg", "/lotos/01.jpg", "/lotos/02.jpg", "/lotos/03.jpg", ],
    "technologies": ["Autocad", ],
    "address": "Пловдив, ул. Лотос",   
    },


    # АВТОМАТИЧНА ТАБЛИЦА ПОД, СТЕНИ, ТАВАН
    {
    "id": 3,
    "name": 'Автоматична таблица под, стени, таван',
    "end date": "2024-03-27",
    "end month": "03",
    "end year": "2024",
    "description": """Личен проект за автоматично попълване на таблицата за под, стени, таван
                    Представлява група от свързани обекти, които ми спестяват нуждата да попълвам квадратурите 
                    на две места (в план и в таблицата). Квадратурата се взима автоматично от обекта и се записва
                    и на двете места. При добавяне на помещение номерата на последващите помещения се коригират
                    автоматично. Това ми спестява много време иначе похабено в търсене кое на кое отговаря и дали 
                    са еднакви стойностите. В линка по-долу можете да видите и видео представяне.""",
    "cover": "tablica/00.jpg",
    "gallery": ["/tablica/00.jpg", ],
    "technologies": ["Autocad", "automation", ],
    "presentation": "https://youtu.be/corOU_mOm8Q",
    },


    # АПТЕЧЕН СКЛАД 180130
    {
    "id": 2,
    "name": 'Реконструкция на административна сграда с аптечен склад',
    "end date": "2018-01-30",
    "end month": "01",
    "end year": "2018",
    "description": "Проектът предвижда ремонт и преустройство на двуетажна административна сграда, като част от първия етаж ще бъде аптечен склад, а останалите части – офиси. Включени са достъпен вход с охрана и стълбищен подемник за хора с увреждания. Основните промени включват нова дограма, подмяна на осветителни и електрически инсталации, климатична система, както и обособени товарен вход и изход за аптечния склад с помещения за почивка и бракувана стока.",
    "cover": "pharmacy/00.jpg", 
    "gallery": ["/pharmacy/00.jpg", "/pharmacy/01.jpg", "/pharmacy/02.jpg", ],
    "technologies": ["Autocad", ],
    "address": "гара Верила",  
    },


    # ДНА СЛИВНИЦА 160925
    {
    "id": 1,
    "name": 'Реконструкция на Народно читалище „Съзнание – 1907"',
    "end date": "2016-09-25",
    "end month": "09",
    "end year": "2016",
    "description": """Сградата е построена през 1932г. и е предназначена за културни събития. 
                    Проектът предвижда реконструкция на покривната конструкция, фасадни възстановителни 
                    дейности, и подобрения във функционалното разпределение. Първият етаж включва зали 
                    и канцеларии, а вторият – канцеларии и тераса с достъп до театралния балкон. Интересното 
                    на този обект беше да се защити противопожарно съществуващата дървена конструкция на покрива,
                    който беше видим елемент в голямата зала.""",
    "cover": "dna_slivnitsa/00.jpg", 
    "gallery": ["/dna_slivnitsa/00.jpg", "/dna_slivnitsa/01.jpg", "/dna_slivnitsa/02.jpg", "/dna_slivnitsa/03.jpg", "/dna_slivnitsa/04.jpg", ],
    "technologies": ["Autocad", ],
    "address": "Сливница, ул. Паисий Хилендарски",   
    }
]


tech_data = {
    "Архитектура": [
        "проектиране във фази ИП, ТП, РП;",
        "изготвяне на количествено - стоиностни сметки;",
        "съгласуване със специалностите;",
        "презентиране и обсъждане с възложител;",
        "изработка на 3D визуализации и клипове;",
        "изработка на клипове и виртуални разходки в обекта;",
        "познаване на нормативната уредба, вкл. наредбата за достъпна среда;",
    ],
    "ПУСО": ["изготвяне проекти по част ПУСО;"],
    "ПБ": [
        "изготвяне на проекти по част Пожарна безопасност за жилищни сгради;", 
        "изработка на евакуационни схеми;"
      ],      
}


soft_data = {
    "Archicad": [
        "BIM моделиране;",
        "визуализации;",
        "автоматична документация;",
    ],
    "Autocad": [ 
        "богат опит с Autocad",
        "работа с layout и Publisher;",
        "създаване на динамични блокове;",
        "създаване на блокове със свързани property;",
    ],
    "Lumion" :[
        "интериорни и екстериорни визуализации;",
        "изработка на клипове и виртуални разходки в обекта;",
    ],   
    "MS Office": [
        "EXCEL: богат опит, вкл. таблици за автоматично калкулиране;",
        "WORD: богат опит, вкл. работа с вложени обекти;",
        "ACCESS: работа с бази данни и SQL queering;",
    ],   
    "Photoshop": [
        "post processing;",
    ],    
    "3DS Max": [
        "изграждане на комплексни аморфни форми;",
    ], 
    "автоматизация": [
      "изграждане на таблици за автоматично извеждане на данни за КС;"
    ],
}


experience = [
    {
        "title": "„Селко 7“ ЕООД",
        "start date": "2016-09-01",
        "start month": "09",
        "start year": "2016",
        "end date": "2023-06-01",
        "end month": "06",
        "end year": "2023",
        "description": "Дейност: проектиране на жилищни, обществени и промишлени сгради, вкл. реконструкции, саниране, технически паспорти.",
        "bullets": [
            "извършване на огледи, обсъждания и архитектурни заснемания;",
            "управление на цялостния процес по проектиране във фази ИП, РП, ТП, вкл. комуникация с възложителя, организиране и управление на екип от специалисти и инженери;",
            "изготвяне на проектно - сметна документация;",
            "автоматизация на процеси;",
            "изработка и представяне на интерактивни презентации вкл. 3D",
        ]
    },
    {
        "title": "„Хаусмайстер“ AД,",
        "start date": "2013-03-01",
        "start month": "03",
        "start year": "2013",
        "end date": "2016-03-01",
        "end month": "03",
        "end year": "2016",
        "description": "Дейност: проектиране на жилищни, обществени и промишлени сгради, вкл. реконструкции, саниране, технически паспорти.",
        "bullets": [
            "извършване на огледи, заснемания, офериране, КСС;",
            "участие в проектирането и изчертаване на интериорни решения;",
            "автоматизация на процеси;",
            "изготвяне на статистики и отчети;",
            "изработка на презентации и 3D визуализации;",
        ]
    },
        {
        "title": "арх. В.Генова, арх. Д.Андреева, арх. И.Тончев, арх. Е.Христов, арх. М.Стойчев",
        "start date": "2008-05-01",
        "start month": "05",
        "start year": "2008",
        "end date": "2013-04-01",
        "end month": "04",
        "end year": "2013",
        "description": "Дейности: Проектиране на жилищни, обществени и промишлени сгради. Реконструкция на банкови офиси, жилищни интериори.",
        "bullets": [
            "извършване на огледи и заснемания;",
            "изработка на чертежи, спецификации, детайли, 3D визуализации;",
        ]
    },
]

filters = ["Archicad", "Autocad", "Lumion", "MS_Office", "automation",]

exceptions = ["3DS Max", "Photoshop"]
