projects = [
    # СОЦИАЛНИ ШУМЕН
    # {
    # "name": 'Център за резидентна грижа за пълнолетни лица с психични разстройства',
    # "end date": "2024-10-27",
    # "end month": "10",
    # "end year": "2024",
    # "description": "Проектът създава три резидентни къщи с общ капацитет 15 души, предоставящи домашна среда и комфорт за дългосрочна грижа. Двуетажната „Сграда 1“ и две едноетажни сгради обединяват общо дворно пространство с обособени зони за дейности и релаксация. Достъпността е приоритет, със системи за сигурност и фотоволтаична инсталация за енергийна ефективност.",
    # "cover": "kashta_german.jpg",
    # "technologies": ["Autocad", "Archicad"],
    # "presentation": "",
    # "address": "с. Царев брод, община Шумен",
    # },
    # КЪЩА ЛЮЦКАНОВИ 230512
    {
    "name": 'Къща част от затворен комплекс',
    "end date": "2023-05-12",
    "end month": "05",
    "end year": "2023",
    "description": "Луксозна къща с лятна кухня, част от затворен комплекс. Проектът включва хол през две нива, спа зона и работни кабинети и жилищни помещения. По желание на клиента беше изпълнена симулация на целодневното ослънчаването в хола и интерактивна презентация с включени 2D, 3D и виртуална реалност",
    "cover": "kashta_german.jpg",
    "gallery": [],
    "technologies": ["Autocad", "Archicad"],
    "presentation": "",
    "address": "с. Герман",
    },
    # СЪД СТАМБОЛИЙСКИ 230512
    {
    "name": 'ИП за ремонт и преустройство на сграда на съдебната власт',
    "end date": "2023-05-11",
    "end month": "05",
    "end year": "2023",
    "description": "",
    "cover": "sad_stamboliiski.jpg",
    "technologies": ["Autocad", "Archicad"],
    "presentation": "",
    "address": "София, бул. Стамболийски",
    },
    # ЕДНО ВРЕМЕ 220805
    {
    "name": 'Къща за гости "Едно време"',
    "end date": "2022-08-05",
    "end month": "08",
    "end year": "2022",
    "description": "Къща за гости в зона на културно наследство. Триетажната сграда съчетава традиционната карловска архитектура с модернистични елементи, използвайки естествени материали като камък и дърво. Първият етаж включва рецепция, дневна и стаи със самостоятелни изходи към двора. Проектът придава уют и функционалност, осигурявайки комфорт за гостите в съвременна среда.",
    "cover": "edno_vreme.jpg",
    "technologies": ["Archicad", "Autocad", "Lumion"],
    "presentation": "",
    "address": "Карлово, ул.Раковска 7",
    "link": "https://ednovreme.eu/",
    },
    # КЪЩА ОСОИЦА
    {
    "name": 'Еднофамилна къща',
    "end date": "2022-07-27",
    "end month": "07",
    "end year": "2022",
    "description": "Двуетажна еднофамилна къща. Проектът включва общи помещения (зона 'ден') на първи етаж и спални на втори етаж (зона 'нощ'). До къщата е долепена лятна кухня с трапезария, а до нея гараж за два автомобила. По желание на клиента беше изпълнена интерактивна презентация с включени 2D, 3D и виртуална реалност. За съжаление проектът не се реализира.",
    "cover": "kashta_osoica.jpg",
    "technologies": ["Autocad", "Archicad", ],
    "presentation": "",
    "address": "с. Осойца",
    },
    # ЕЕ ВАСИЛ АПРИЛОВ 220324
    {
    "name": 'Саниране на блок в Пловдив, ул.Васил Априлов',
    "end date": "2022-03-24",
    "end month": "03",
    "end year": "2022",
    "description": "Саниране на жилищен блок с четири входа по програмата за енергийна ефективност.",
    "cover": "plovdiv_aprilov.jpg",
    "technologies": ["Autocad", ],
    "presentation": "",
    "address": "Пловдив, бул.Васил Априлов", 
    },
    # 3D ИЛИНДЕН 220218
    {
    "name": 'Видео разходка около жилищна сграда на Захарна фабрика',
    "end date": "2022-02-18",
    "end month": "02",
    "end year": "2022",
    "description": "Реставрация на сграда паметник на културата, част от комплекса на Захарна фабрика. Моето участие беше направата на тази виртуална разходка около сградата.",
    "cover": "Ilinden.png",
    "technologies": ["Archicad", "Lumion"],
    "presentation": "https://youtu.be/zj62q2KO0ik",
    "address": "София, кв. Илинден",    
    },
    # ЦОП ВАРНА 200331
    {
    "name": 'Център за подкрепа на лица с увреждания',
    "end date": "2020-03-31",
    "end month": "03",
    "end year": "2020",
    "description": "Проектът предвижда реновиране на съществуваща сграда в ж.к. „Дружба“, Варна, за „Център за подкрепа на лица с увреждания“. Центърът осигурява дневна и почасова грижа, рехабилитация, консултации и арт-терапия за до 90 души. Пространството включва специализирани зали, медицински кабинет, кухни и санитарни помещения, с акцент върху достъпност и безопасност. Интериорът е с функционално разпределение и материали, позволяващи лесна поддръжка и дълготрайност.",
    "cover": "cop_varna.jpg",
    "technologies": ["Autocad", ],
    "presentation": "",
    "address": "Варна, кв. „Аспарухово“, блок 11,",
    "link": "https://live.varna.bg/bg/news/dneven_centar_za_palnoletni_lica_s_tejki_uvrejdania_zapochva_rabota_ot_parvi_april.html",    
    },
    # СОУ ЛУКОВИТ 190603
    {
    "name": 'Саниране на СОУ Алеко Константинов',
    "end date": "2019-06-03",
    "end month": "06",
    "end year": "2019",
    "description": "Проектът представлява саниране на СОУ Алеко Константинов. В училището бяха изпълнени мерки за привеждане към нормите за достъпна среда, вкл. изграждане на асансьор. В дворното пространство бяха изпълнени нови спортни съоръжения и рехабилитирани старите салон, игрища и съблекални.",
    "cover": "sou-al-konstantinov.jpg",
    "technologies": ["Autocad", ],
    "presentation": "",
    "address": "Луковит, ул. Възраждане 104",
    "link": "https://su-lukovit.com/c-priem",    
    },
    # ЦОП ПЛОВДИВ 190311
    {
    "name": 'Реконструкция на Център за обществена подкрепа',
    "end date": "2019-03-11",
    "end month": "03",
    "end year": "2019",
    "description": "Сградата e построена през 1884г, е културна ценност с местно значение. Проектът предвижда трансформация на сградата в общностен център, състоящ се от три крила за социални услуги, с минимална фасадна намеса. Включва центрове за обществена подкрепа и дневни центрове за деца с увреждания, с осигурена достъпна среда чрез рампи, широки входове и асансьори. Разполагане на специализирано медицинско и рехабилитационно обзавеждане според зададени функции.",
    "cover": "cop_plovdiv.jpg",
    "technologies": ["Autocad", "MS Office"],
    "presentation": "",
    "address": "Пловдив, ул. Димитър Цончев № 11",
    "link": "https://detebg.org/",    
    },
    #ЕЕ ПЛОВДИВ ЛОТОС 180709
    {
    "name": 'Саниране на блок в Пловдив, ул.Лотос',
    "end date": "2018-07-09",
    "end month": "07",
    "end year": "2018",
    "description": "Саниране на дву секционен жилищен блок по програмата за енергийна ефективност.",
    "cover": "lotos.jpg",
    "technologies": ["Autocad", ],
    "presentation": "",
    "address": "Пловдив, ул. Лотос",   
    },
    # АПТЕЧЕН СКЛАД 180130
    {
    "name": 'Реконструкция на административна сграда с аптечен склад',
    "end date": "2018-01-30",
    "end month": "01",
    "end year": "2018",
    "description": "Проектът предвижда ремонт и преустройство на двуетажна административна сграда, като част от първия етаж ще бъде аптечен склад, а останалите части – офиси. Включени са достъпен вход с охрана и стълбищен подемник за хора с увреждания. Основните промени включват нова дограма, подмяна на осветителни и електрически инсталации, климатична система, както и обособени товарен вход и изход за аптечния склад с помещения за почивка и бракувана стока.",
    "cover": "pharmacy.jpg",
    "technologies": ["Autocad", ],
    "presentation": "",
    "address": "гара Верила",  
    },
    # ДНА СЛИВНИЦА 160925
    {
    "name": 'Реконструкция на Народно читалище „Съзнание – 1907"',
    "end date": "2016-09-25",
    "end month": "09",
    "end year": "2016",
    "description": "Сградата е построена през 1932г. и е предназначена за културни събития. Проектът предвижда реконструкция на покривната конструкция, фасадни възстановителни дейности, и подобрения във функционалното разпределение. Първият етаж включва зали и канцеларии, а вторият – канцеларии и тераса с достъп до театралния балкон.",
    "cover": "dna_slivnitsa.jpg",
    "technologies": ["Autocad", ],
    "presentation": "",
    "address": "Сливница, ул. Паисий Хилендарски",   
    },
    # КЪЩА ВЕРГОВИ
    {
    "name": 'Надстройка и пристройка на къща',
    "end date": "2016-09-07",
    "end month": "09",
    "end year": "2016",
    "description": "Проектът представлява изпълнение на пристройка и надстройка на стара къща, както и обширни покрити тераси. За съжаление проектът не беше реализиран.",
    "cover": "kashta_vergovi.jpg",
    "technologies": ["Autocad", "Archicad"],
    "presentation": "",
    "address": "с. Поповци",   
    },

]



tech_data = {
    "Архитектура": [
        "проектиране във фази ИП, ТП, РП;",
        "изготвяне на количествено - стоиностни сметки;",
        "съгласуване със специалностите;",
        "презентиране и обсъждане с възложител;",
        "изработка на 3D визуализации и клипове;",
        "изработка на клипове и виртуални разходки в обекта;",
        "познаване на нормативната уредба, вкл. наредбата за достъпна среда;",
    ],
    "ПУСО": ["изготвяне проекти по част ПУСО;"],
    "ПБ": [
        "изготвяне на проекти по част Пожарна безопасност за жилищни сгради;", 
        "изработка на евакуационни схеми;"
      ],      
}


soft_data = {
    "Archicad": [
        "BIM моделиране;",
        "визуализации;",
        "автоматична документация;",
    ],
    "Autocad": [ 
        "богат опит с Autocad",
        "работа с layout и Publisher;",
        "създаване на динамични блокове;",
        "създаване на блокове със свързани property;",
    ],
    "Lumion" :[
        "интериорни и екстериорни визуализации;",
        "изработка на клипове и виртуални разходки в обекта;",
    ],   
    "MS Office": [
        "EXCEL: богат опит, вкл. таблици за автоматично калкулиране;",
        "WORD: богат опит, вкл. работа с вложени обекти;",
        "ACCESS: работа с бази данни и SQL queering;",
    ],   
    "Photoshop": [
        "post processing;",
    ],    
    "3DS Max": [
        "изграждане на комплексни аморфни форми;",
    ], 
    "автоматизация": [
      "изграждане на таблици за автоматично извеждане на данни за КС;"
    ],
}




experience = [
    {
        "title": "„Селко 7“ ЕООД",
        "start date": "2016-09-01",
        "start month": "09",
        "start year": "2016",
        "end date": "2023-06-01",
        "end month": "06",
        "end year": "2023",
        "description": "Дейност: проектиране на жилищни, обществени и промишлени сгради, вкл. реконструкции, саниране, технически паспорти.",
        "bullets": [
            "извършване на огледи, обсъждания и архитектурни заснемания;",
            "управление на цялостния процес по проектиране във фази ИП, РП, ТП, вкл. комуникация с възложителя, организиране и управление на екип от специалисти и инженери;",
            "изготвяне на проектно - сметна документация;",
            "автоматизация на процеси;",
            "изработка и представяне на интерактивни презентации вкл. 3D",
        ]
    },
    {
        "title": "„Хаусмайстер“ AД,",
        "start date": "2013-03-01",
        "start month": "03",
        "start year": "2013",
        "end date": "2016-03-01",
        "end month": "03",
        "end year": "2016",
        "description": "Дейност: проектиране на жилищни, обществени и промишлени сгради, вкл. реконструкции, саниране, технически паспорти.",
        "bullets": [
            "извършване на огледи, заснемания, офериране, КСС;",
            "участие в проектирането и изчертаване на интериорни решения;",
            "автоматизация на процеси;",
            "изготвяне на статистики и отчети;",
            "изработка на презентации и 3D визуализации;",
        ]
    },
        {
        "title": "арх. В.Генова, арх. Д.Андреева, арх. И.Тончев, арх. Е.Христов, арх. М.Стойчев",
        "start date": "2008-05-01",
        "start month": "05",
        "start year": "2008",
        "end date": "2013-04-01",
        "end month": "04",
        "end year": "2013",
        "description": "Дейности: Проектиране на жилищни, обществени и промишлени сгради. Реконструкция на банкови офиси, жилищни интериори.",
        "bullets": [
            "извършване на огледи и заснемания;",
            "изработка на чертежи, спецификации, детайли, 3D визуализации;",
        ]
    },
]

exceptions = ["3DS Max", "Photoshop"]
