tech_data = {
    "Архитектура": [
        "проектиране във фази ИП, ТП, РП;",
        "изготвяне на количествено - стоиностни сметки;",
        "съгласуване със специалностите;",
        "презентиране и обсъждане с възложител;",
        "изработка на 3D визуализации и клипове;",
        "изработка на клипове и виртуални разходки в обекта;",
        "познаване на нормативната уредба, вкл. наредбата за достъпна среда;",
    ],
    "ПУСО": ["изготвяне проекти по част ПУСО;"],
    "ПБ": [
        "изготвяне на проекти по част Пожарна безопасност за жилищни сгради;", 
        "изработка на евакуационни схеми;"
      ],      
}


soft_data = {
    "Archicad": [
        "BIM моделиране;",
        "визуализации;",
        "автоматична документация;",
    ],
    "Autocad": [ 
        "богат опит с Autocad"
        "създаване на динамични блокове;",
        "създаване на блокове със свързани property",
    ],
    "Lumion" :[
        "интериорни и екстериорни визуализации;",
        "изработка на клипове и виртуални разходки в обекта;",
    ],
    "Photoshop": [
        "post processing;",
    ],      
    "MS Office": [
        "таблици за автоматично калкулиране;",
    ],      
    "3DS Max": [
        "изграждане на комплексни аморфни форми;",
    ], 
    "автоматизация": [
      "изграждане на таблици за автоматично извеждане на данни за КС;"
    ],
}


projects = [
    {
    "name": "Portfolio website",
    "start date": "2024-06-22",
    "start month": "05",
    "start year": "2024",
    "end date": "2024-06-25",
    "end month": "06",
    "end year": "2024",
    "description": "Dynamic portfolio website with four pages",
    "technologies": ["Archicad", "Autocad",],
    "complexity": "advanced",
    "readme": "https://github.com/yasen-sotirov/portfolio_website/blob/master/README.md",
    "source code": "https://github.com/yasen-sotirov/personal_projects/tree/main/portfolio_website_2.0",  
    },
    {  
    "name": "To Do List App",
    "start date": "2024-06-14",
    "start month": "06",
    "start year": "2024",
    "end date": "2024-06-15",
    "end month": "06",
    "end year": "2024",
    "description": "Weather App: Check the weather, humidity, and wind speed for any city worldwide. Data is provided by www.openweathermap.org",
    "technologies": ["автоматизация"],
    "complexity": "simple",
    "readme": "https://github.com/yasen-sotirov/todo_list/blob/main/README.md",
    "source code": "https://github.com/yasen-sotirov/todo_list",
    "run code": "https://yasen-sotirov.github.io/todo_list/"
    },
]

experience = [
    {
        "title": "„Селко 7“ ЕООД",
        "start date": "2016-09-01",
        "start month": "09",
        "start year": "2016",
        "end date": "2023-06-01",
        "end month": "06",
        "end year": "2023",
        "description": "Дейност: проектиране на жилищни, обществени и промишлени сгради, вкл. реконструкции, саниране, технически паспорти.",
        "bullets": [
            "извършване на огледи, обсъждания и архитектурни заснемания;",
            "управление на цялостния процес по проектиране във фази ИП, РП, ТП, вкл. комуникация с възложителя, организиране и управление на екип от специалисти и инженери;",
            "изготвяне на проектно - сметна документация;",
            "автоматизация на процеси;",
            "изработка и представяне на интерактивни презентации вкл. 3D",
        ]
    },
    {
        "title": "„Хаусмайстер“ AД,",
        "start date": "2013-03-01",
        "start month": "03",
        "start year": "2013",
        "end date": "2016-03-01",
        "end month": "03",
        "end year": "2016",
        "description": "Дейност: проектиране на жилищни, обществени и промишлени сгради, вкл. реконструкции, саниране, технически паспорти.",
        "bullets": [
            "извършване на огледи, заснемания, офериране, КСС;",
            "участие в проектирането и изчертаване на интериорни решения;",
            "автоматизация на процеси;",
            "изготвяне на статистики и отчети;",
            "изработка на презентации и 3D визуализации;",
        ]
    },
        {
        "title": "арх. В.Генова, арх. Д.Андреева, арх. И.Тончев, арх. Е.Христов, арх. М.Стойчев",
        "start date": "2008-05-01",
        "start month": "05",
        "start year": "2008",
        "end date": "2013-04-01",
        "end month": "04",
        "end year": "2013",
        "description": "Дейности: Проектиране на жилищни, обществени и промишлени сгради. Реконструкция на банкови офиси, жилищни интериори.",
        "bullets": [
            "извършване на огледи и заснемания;",
            "изработка на чертежи, спецификации, детайли, 3D визуализации;",
        ]
    },
]

exceptions = ["3DS Max", "Photoshop"]
